### Ordinal Encoding

In [2]:
import datetime

In [4]:
today_date = datetime.datetime.today()

In [5]:
today_date

datetime.datetime(2024, 11, 28, 13, 18, 32, 498640)

In [7]:
today_date - datetime.timedelta(1)

datetime.datetime(2024, 11, 27, 13, 18, 32, 498640)

In [12]:
# List Comprehension
days = [today_date-datetime.timedelta(x) for x in range(0,15)]

In [13]:
import pandas as pd

In [14]:
data = pd.DataFrame(days)
data.columns= ['Day']

In [15]:
data.head()

                         Day
0 2024-11-28 13:18:32.498640
1 2024-11-27 13:18:32.498640
2 2024-11-26 13:18:32.498640
3 2024-11-25 13:18:32.498640
4 2024-11-24 13:18:32.498640

In [26]:
data['Weekday'] = data['Day'].dt.day_name()
data.head()

                         Day    Weekday
0 2024-11-28 13:18:32.498640   Thursday
1 2024-11-27 13:18:32.498640  Wednesday
2 2024-11-26 13:18:32.498640    Tuesday
3 2024-11-25 13:18:32.498640     Monday
4 2024-11-24 13:18:32.498640     Sunday

In [27]:
dict = {'Monday':1,'Tuesday':2,'Wednesday':3,'Thursday':4,'Friday':5,'Saturday':6,'Sunday':7}

In [28]:
dict

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [31]:
data['Weekday_ordinal'] = data['Weekday'].map(dict)

In [33]:
data

                          Day    Weekday  Weekday_ordinal
0  2024-11-28 13:18:32.498640   Thursday                4
1  2024-11-27 13:18:32.498640  Wednesday                3
2  2024-11-26 13:18:32.498640    Tuesday                2
3  2024-11-25 13:18:32.498640     Monday                1
4  2024-11-24 13:18:32.498640     Sunday                7
5  2024-11-23 13:18:32.498640   Saturday                6
6  2024-11-22 13:18:32.498640     Friday                5
7  2024-11-21 13:18:32.498640   Thursday                4
8  2024-11-20 13:18:32.498640  Wednesday                3
9  2024-11-19 13:18:32.498640    Tuesday                2
10 2024-11-18 13:18:32.498640     Monday                1
11 2024-11-17 13:18:32.498640     Sunday                7
12 2024-11-16 13:18:32.498640   Saturday                6
13 2024-11-15 13:18:32.498640     Friday                5
14 2024-11-14 13:18:32.498640   Thursday                4

## Count or Frequency Encoding

## Target Guided Oridnal Encoding

In [35]:
df = pd.read_csv('https://raw.githubusercontent.com/krishnaik06/Feature-Engineering-Live-sessions/refs/heads/master/titanic.csv')

In [36]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [37]:
df['Cabin'].fillna('Missing',inplace = True)

In [41]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,Missing,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,Missing,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,Missing,S

In [43]:
df['Cabin'] = df['Cabin'].astype(str).str[0]

In [47]:
df[['Survived','Cabin']].head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [48]:
df['Cabin'].unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [55]:
ordinal_labels = df.groupby(['Cabin'])['Survived'].mean().sort_values().index

In [54]:
df.groupby(['Cabin'])['Survived'].mean().sort_values()

Cabin
T    0.000000
M    0.299854
A    0.466667
G    0.500000
C    0.593220
F    0.615385
B    0.744681
E    0.750000
D    0.757576
Name: Survived, dtype: float64

In [56]:
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [60]:
o_d_2 = {k:i for i,k in enumerate(ordinal_labels,0)}

In [61]:
o_d_2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [62]:
df['Cabin_ordinal']  = df['Cabin'].map(o_d_2)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Cabin_ordinal
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,M,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,C,4
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,M,S,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C,S,4
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,M,S,1

## Mean Encoding

In [65]:
mean_ordinal = df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [66]:
df['Cabin_ordinal_mean']  = df['Cabin'].map(mean_ordinal)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Cabin_ordinal,Cabin_ordinal_mean
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,M,S,1,0.299854
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,C,4,0.593220
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,M,S,1,0.299854
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C,S,4,0.593220
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,M,S,1,0.299854

## Probability ratio Encoding

In [90]:
data3 = pd.read_csv('https://raw.githubusercontent.com/krishnaik06/Feature-Engineering-Live-sessions/refs/heads/master/titanic.csv',usecols = ['Cabin','Survived'])

In [91]:
data3.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [92]:
# Replacing with 'missing'
data3['Cabin'] = data3['Cabin'].fillna('missing')
data3.head()

   Survived    Cabin
0         0  missing
1         1      C85
2         1  missing
3         1     C123
4         0  missing

In [93]:
data3['Cabin'].unique()

array(['missing', 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [94]:
data3['Cabin'] = data3['Cabin'].astype(str).str[0]

In [95]:
data3.head()

   Survived Cabin
0         0     m
1         1     C
2         1     m
3         1     C
4         0     m

In [96]:
## Ratio Encoding
prob_df = data3.groupby(['Cabin'])['Survived'].mean()

In [97]:
prob_df = pd.DataFrame(prob_df)

In [98]:
prob_df

       Survived
Cabin
A      0.466667
B      0.744681
C      0.593220
D      0.757576
E      0.750000
F      0.615385
G      0.500000
T      0.000000
m      0.299854

In [102]:
prob_df['died'] = 1-prob_df['Survived']

In [103]:
prob_df.head()

       Survived      died
Cabin
A      0.466667  0.533333
B      0.744681  0.255319
C      0.593220  0.406780
D      0.757576  0.242424
E      0.750000  0.250000

In [104]:
prob_df['pb_ration'] = prob_df['Survived'] / prob_df['died']

In [106]:
prob_df.head()

       Survived      died  pb_ration
Cabin
A      0.466667  0.533333   0.875000
B      0.744681  0.255319   2.916667
C      0.593220  0.406780   1.458333
D      0.757576  0.242424   3.125000
E      0.750000  0.250000   3.000000

In [109]:
prob_encoded = prob_df['pb_ration'].to_dict()

In [110]:
prob_encoded

{'A': 0.875,
 'B': 2.916666666666666,
 'C': 1.4583333333333333,
 'D': 3.125,
 'E': 3.0,
 'F': 1.6000000000000003,
 'G': 1.0,
 'T': 0.0,
 'm': 0.42827442827442824}

In [113]:
data3['Cabin_Encoded']  = data3['Cabin'].map(prob_encoded)
data3.head()

   Survived Cabin  died  Cabin_Encoded
0         0     m     1       0.428274
1         1     C     0       1.458333
2         1     m     0       0.428274
3         1     C     0       1.458333
4         0     m     1       0.428274

In [114]:
data3.head()

   Survived Cabin  died  Cabin_Encoded
0         0     m     1       0.428274
1         1     C     0       1.458333
2         1     m     0       0.428274
3         1     C     0       1.458333
4         0     m     1       0.428274